Repository: PanosTheo97/thesis-fitness-app
Catalog: Thesis Fitness App/Thesis Fitness App/Resources/Localization/*.lproj/Localizable.strings
Languages: el

source: User
el: Χρήστης

# Welcome_welcomeLabel
source: Welcome
el: Καλωσήρθες

# Welcome_googleSignInLabel
source: Sign in with Google
el: Σύνδεση με Google

# Welcome_guestButton
source: Or continue as Guest
el: Ή συνέχισε ως καλεσμένος

# Registration_Name_titleLabel
source: What is your name?
el: Ποιό είναι το όνομα σου;

# Registration_Name_placeholder
source: Name
el: Όνομα

# Registration_BodyComposition_titleLabel
source: Give us the following body composition measurements
el: Δώσε τις παρακάτω μετρήσεις σχετικά με το σώμα σου

# Registration_BodyComposition_weightPlaceholder
source: Weight (in kg.)
el: Βάρος (σε kg.)

# Registration_BodyComposition_musclePlaceholder
source: Lean Muscle Mass Percentage (%) - Optional
el: Ποσοστό Μυικής Μάζας (%) - Προεραιτικά

# Registration_BodyComposition_fatPlaceholder
source: Fat Mass Percentage (%) - Optional
el: Ποσοστό Λιπώδους Ιστού (%) - Προεραιτικά

# Registration_ActivityGoals_titleLabel
source: If you want, set daily goals and we will help you track them!
el: Εαν θέλεις, θέσε ημερίσιους στόχους κι εμείς θα σε βοηθήσουμε να τους ελέγχεις!

# Registration_ActivityGoals_stepsPlaceholder
source: Steps
el: Βήματα

# Registration_ActivityGoals_caloriesPlaceholder
source: Calories Burned
el: Καύση Θερμίδων

# Registration_DietyGoals_titleLabel
source: Almost Done! If you want, set daily diet goals and track them in the diet tab!
el: Σχεδον τελείωσες!/nΕαν θέλεις, θέσε ημερίσιους διατροφικούς στόχος και έλεγξε τους στο αντίστοιχο παράθυρο!

# Registration_DietGoals_caloriesPlaceholder
source: Calorie Intake (in kcal)
el: Πρόσληψη Θερμίδων (in kcal)

# Registration_DietGoals_proteinPlaceholder
source: Protein Intake (in gram.)
el: Πρόσληψη Πρωτεΐνης (σε γραμ.)

# Registration_DietGoals_carbsPlaceholder
source: Carbohydrates Intake (in gram.)
el: Πρόσληψη Υδατανθράκων (σε γραμ.)

# Registration_DietGoals_fatsPlaceholder
source: Fats Intake (in gram.)
el: Πρόσληψη Λίπους (σε γραμ.)

# Registration_DietGoals_waterPlaceholder
source: Water Intake (in mL.)
el: Πρόσληψη Νερού (σε μλ.)

# Lobby_homeTitle
source: Home
el: Αρχική

# Lobby_activityTitle
source: Activity
el: Άθληση

# Lobby_workoutTitle
source: Workout
el: Γυμναστήριο

# Lobby_dietTitle
source: Diet
el: Διατροφή

# Lobby_profileTitle
source: Profile
el: Προφίλ

# Profile_logoutButton
source: Logout
el: Αποσύνδεση

# Home_displayNameLabel
source: Hello, %@
el: Γειά σου, %@

# Activity_activityTitleLabel
source: Pick an activity and start exercising!
el: Διάλεξε μια δραστηριότητα και ξεκίνα να αθλείσαι!

# Activity_pickYourFavorites
source: Choose your favorite activities to receive exciting challenges!
el: Διάλεξε τις αγαπημένες σου δραστηριότητες για να λαμβάνεις ενδιαφέρουσες προκλήσεις!

# Activity_running
source: Running
el: Τρέξιμο

# Activity_climbing
source: Climbing
el: Αναρρίχηση

# Activity_cycling
source: Cycling
el: Ποδηλασία

# Activity_indoorRunning
source: Indoor Running
el: Διάδρομος

# Activity_walking
source: Walking
el: Περπάτημα

# Activity_jumpingRope
source: Jumbing Rope
el: Σχοινάκι

# Activity_boxing
source: Boxing
el: Πυγμαχία

# Activity_pingPong
source: Ping Pong
el: Πινγκ Πονγκ

# ActivityParameter_titleLabel
source: If you want, set your Activity Goal
el: Εαν επιθυμείς, θέσε ένα στόχο για την άθληση σου

# ActivityParameter_parameterButton
source: Tap here to choose a goal
el: Πάτησε εδώ και διάλεξε ένα στόχο

# ActivityParameter_startButton
source: Start
el: Εκκίνηση

# ActivitySession_breakTitleLabel
source: Break
el: Διάλειμμα

# ActivitySession_paceTitleLabel
source: Pace
el: Ρυθμός

# ActivitySession_distanceTitleLabel
source: Distance
el: Αποόσταση

# ActivitySession_stopButtonPopover
source: Hold to stop session
el: Κράτα για να σταματήσεις την άθληση

# ActivitySession_discardSession_mainText
source: Are you sure you want to discard your session? All session data will be lost!
el: Είσαι σίγουρος ότι θέλεις να φύγεις; Όλα τα δεδομένα αυτής της άθλησης θα χαθούν!

# ActivitySession_discardSession_cancel
source: Cancel
el: Άκυρο

# ActivitySession_discardSession_discard
source: Discard
el: Έξοδος

# ActivitySession_kilometers
source: %.3fkm.
el: %.3fχλμ.

# ActivitySession_pace
source: %.2f min/km
el: %.2f λεπ/χλμ

# ActivitySession_locationAlert
source: Please allow Always location from settings for map functionality
el: Εαν επιθυμείς τη λειτουργικότητα του χάρτη, επέτρεψε τη χρήση τοποθεσίας πάντα από τις ρυθμήσεις

# ActivitySession_annotation_start
source: Starting Point
el: Σημείο εκκίνησης

# ActivitySession_annotation_finish
source: Ending Point
el: Σημείο τερματισμού

# ActivitySession_annotation_start_description
source: This is where you started
el: Εδώ ξεκίνησες τη διαδρομή σου

# ActivitySession_annotation_finish_description
source: This is where you finished
el: Εδώ τελείωσες τη διαδρομή σου

# Diet_FAB_addMacros
source: Add Macros
el: Πρόσθεσε Μακροθρεπτικά

# Diet_FAB_addFood
source: Add Food
el: Πρόσθεσε Φαγητό

# MacroTypeEnum_caloriesTitle
source: Calories
el: Θερμίδες

# MacroTypeEnum_waterTitle
source: Water
el: Νερό

# MacroTypeEnum_proteinTitle
source: Protein
el: Πρωτεΐνη

# MacroTypeEnum_carbohydratesTitle
source: Carbohydrates
el: Υδατάνθρακες

# MacroTypeEnum_fatsTitle
source: Fats
el: Λίπη

# Macros_titleLabel
source: Select and add the quantity of one or more of the Macro-elements!
el: Πρόσθεσε την ποσότητα για ένα ή περισσότερα από τα παρακάτω Μακρο-στοιχεία!

# Macros_placeholder_calories
source: Calories (in kcal)
el: Θερμίδες (σε kcal)

# Macros_placeholder_protein
source: Protein (in gram.)
el: Πρωτεΐνη (σε γραμ.)

# Macros_placeholder_carbohydrates
source: Carbohydrates (in gram.)
el: Υδατάνθρακες (σε γραμ.)

# Macros_placeholder_fats
source: Fats (in gram.)
el: Λίπη (σε γραμ.)

# Macros_placeholder_water
source: Water (in mL.)
el: Νερό (σε μλ.)

# Macros_saveButton
source: Save
el: Αποθήκευση
